---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.ContoursNoncontours
source: html/cf2149e8-42af-69b5-8e41-1aef52548631.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.ContoursNoncontours Property

The layers you have selected contain both contour lines and non-contour lines (lines of non-constant elevation). You may want to go back and select fewer layers, or you can continue, but the boundary of the site may be larger than you want.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContoursNoncontours { get; }
```